package com.example.user.mykmutnb11;

import android.support.v7.app.AppCompatActivity;
import android.os.Bundle;
import android.view.View;
import android.widget.AdapterView;
import android.widget.ListView;
import android.widget.Toast;

import java.util.ArrayList;
import java.util.List;

public class NewsActivity extends  AppCompatActivity implements AdapterView.OnItemClickListener {

    private List<Data> datas = new ArrayList<>();

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_news);

        datas.add(new Data("ประชาสัมพันธ์เพื่อหลีกเลี่ยงเส้นทางการจราจรงานพิธีซ้อมรับพระราชทานปริญญาบัตร มจพ. ","ประชาสัมพันธ์เพื่อหลีกเลี่ยงเส้นทางการจราจรงานพิธีซ้อมรับพระราชทานปริญญาบัตร มจพ. มหาวิทยาลัยเทคโนโลยีพระจอมเกล้าพระนครเหนือ (มจพ.) ได้กำหนดให้มีการซ้อมย่อยและถ่ายภาพหมู่บัณฑิต จึงขอประชาสัมพันธ์เพื่อหลีกเลี่ยงเส้นทางการจราจรในงานพิธีซ้อมรับพระราชทานปริญญาบัตร มจพ. ดังนี้ 1. วันฝึกซ้อมย่อย  วันจันทร์ที่ 5 พฤศจิกายน–วันพฤหัสบดีที่ 8 พฤศจิกายน 2561 เวลา 08.00 น. เป็นต้นไป ณ มหาวิทยาลัยเทคโนโลยีพระจอมเกล้าพระนครเหนือ (มจพ.) 2. วันถ่ายภาพหมู่  วันอาทิตย์ที่ 11 พฤศจิกายน 2561 เวลา 06.00 น. เป็นต้นไป ณ มหาวิทยาลัยเทคโนโลยีพระจอมเกล้าพระนครเหนือ (มจพ.)\n"));
        datas.add(new Data("มจพ. ขอเชิญเฝ้าทูลละอองพระบาท สมเด็จพระเทพรัตนราชสุดาฯ สยามบรมราชกุมารี ","มหาวิทยาลัยเทคโนโลยีพระจอมเกล้าพระนครเหนือ (มจพ.) ขอเชิญเฝ้าทูลละอองพระบาท สมเด็จพระเทพรัตนราชสุดาฯ สยามบรมราชกุมารี ในพิธีพระราชทานปริญญาบัตร แก่ผู้สำเร็จการศึกษา ประจำปี 2560 ในวันพฤหัสบดีที่ 15 พฤศจิกายน 2561 ณ ศูนย์นิทรรศการและการประชุมไบเทค บางนา \n"));
        datas.add(new Data("ศ.ดร.สุทธิศักดิ์ พงศ์ธนาพาณิช บันทึกเทปโทรทัศน์รายการรักเมืองไทย สถานีโทรทัศน์ TNN24 ","วันที่ 29 ตุลาคม 2561  เวลา 13.30 น.  ศาสตราจารย์ ดร.สุทธิศักดิ์ พงศ์ธนาพาณิช  รองคณบดีฝ่ายบริหารและวิชาการ บัณฑิตวิทยาลัย มหาวิทยาลัยเทคโนโลยีพระจอมเกล้าพระนครเหนือ (มจพ.) บันทึกเทปโทรทัศน์ รายการรักเมืองไทย ประเด็น “มจพ. ติด TOP10 มหาวิทยาลัยชั้นนำ 2 ปีซ้อน”  โดยมี ดร.วีรชน  นรานุต เป็นผู้ดำเนินรายการ  ณ สถานีโทรทัศน์ TNN24 ถนนพระราม 6 อาคารทิปโก้\n"));
        datas.add(new Data("ผศ.ดร.พีระวัฒน์ คณะครุศาสตร์ฯ ได้รับการจดสิทธิบัตรนานาชาติ ","ผู้ช่วยศาสตราจารย์ ดร.พีระวัฒน์ นันทวราวงศ์ หัวหน้าศูนย์วิจัยเครื่องมือและเครื่องจักรกลอุตสาหกรรมด้วยระบบไทรโบโลยี สำนักวิจัยวิทยาศาสตร์และเทคโนโลยี มหาวิทยาลัยเทคโนโลยีพระจอมเกล้าพระนครเหนือ (มจพ.) เปิดเผยว่า เมื่อวันที่ 30 พฤษภาคม 2560 ที่ผ่านมา ศาสตราจารย์ ดร. สุชาติ เซี่ยงฉิน อธิการบดี มหาวิทยาลัยเทคโนโลยีพระจอมเกล้าพระนครเหนือ (มจพ.) ให้การต้อนรับ ฯพณฯ ท่าน ดร.พรชัย ด่านวิวัฒน์ เอกอัครราชฑูตไทย ณ กรุงพริทอเรีย ประเทศแอฟริกาใต้ นายอัสรอฟ ศาสนกุล เลขานุการโท ได้มาประชุมหารือเกี่ยวกับการขยายความร่วมมือด้านงานวิจัยระหว่างมหาวิทยาลัยในประเทศแอฟริกาใต้และประเทศไทย ซึ่งเป็นงานวิจัยที่พัฒนาด้านวิศวกรรมศาสตร์ ครั้งแรกที่เกิดขึ้นร่วมกันระหว่างประเทศไทยและประเทศแอฟริกาใต้ ตามที่ผู้ช่วยศาสตราจารย์ ดร.พีระวัฒน์ นันทวราวงศ์  มจพ. ได้รับทุนวิจัย 2 ปี จากรัฐบาลและภาคอุตสาหกรรมการผลิต เรื่อง การพัฒนาเทคโนโลยีการผลิตวัสดุโลหะแข็งความแข็งแกร่งสูง ซึ่งเป็นทุนวิจัยด้าน Tribology of Strong Materials ร่วมกับ Prof. Natasha Sacks และ Prof. Ionel Botef แห่งมหาวิทยาลัยวิตวอเตอร์สแรนด์ (University of the Witwatersrand) ประเทศสาธารณรัฐแอฟริกาใต้  มหาวิทยาลัยวิตวอเตอร์สแรนด์เป็นมหาวิทยาลัยวิจัยมีเครื่องมือทันสมัยในการพัฒนาเทคโนโลยีวัสดุในระดับสูงของนครโจฮันเนสเบิร์ก ปัจจุบันทั้งสองมหาวิทยาลัยได้มี MOU ร่วมกันเพื่อขยายความร่วมมือด้านการวิจัยและด้านวิชาการร่วมกัน เพื่อส่งเสริมและพัฒนาความสามารถในการทำวิจัยในระดับสากลของบุคลากรทางการศึกษา และต่อยอดการพัฒนาการเรียนการสอนที่สามารถรองรับระบบการศึกษาระดับสากล ตามแผนการพัฒนาประเทศไทย นั้น\n"));
        datas.add(new Data("มจพ. รับพระราชทานปริญญาบัตร ประจำปีการศึกษา 2560 (2561) ","สมเด็จพระเจ้าอยู่หัวทรงพระกรุณาโปรดเกล้าฯ ให้สมเด็จพระเทพรัตนราชสุดาฯ สยามบรมราชกุมารี เสด็จพระราชดำเนินแทนพระองค์มาพระราชทานปริญญาบัตรแก่บัณฑิตของมหาวิทยาลัยเทคโนโลยีพระจอมเกล้าพระนครเหนือ (มจพ.) ประจำปีการศึกษา 2560 (พ.ศ.2561) ในวันพฤหัสบดีที่ 15 พฤศจิกายน 2561 ช่วงเช้าและช่วงบ่าย ณ ศูนย์นิทรรศการและการประชุมไบเทค (บางนา) ซึ่งในปีนี้มีบัณฑิตเข้ารับพระราชทานปริญญาบัตร จำนวน 5,200 ราย \n"));

        MyAdapter adapter = new MyAdapter(this,datas);
        ListView lv = (ListView)findViewById(R.id.listView);
        lv.setAdapter(adapter);
        lv.setOnItemClickListener(this);
    }

    @Override
    public void onItemClick(AdapterView<?> parent, View view, int position, long id) {
        Toast.makeText(this,"you click"+String.valueOf(position)+" "+datas.get(position).getmText1(),Toast.LENGTH_SHORT).show();
    }
}
